{
    "Rename Column":{
        "WHAT":"To rename a column in a DataFrame to a new specified name.",
        "WHY":"Improves dataset clarity by renaming verbose, typo-ridden, or inconsistent columns, enhancing readability for users.",
        "EXAMPLE":"Intial column name 'Name', changed column name 'Full Name'"
        
    },

    "Drop Column":{
        "WHAT":"To remove one or more specified columns from a DataFrame.",
        "WHY":"Essential for removing non-contributory columns from large datasets, simplifying the model and potentially improving performance by addressing the curse of dimensionality.",
        "EXAMPLE":"Column specified in the DataFrame titled 'Calories' can be removed from the DataFrame"
         },

    "Data Normalization":{
        "WHAT":"To normalize data in a specified DataFrame column using min-max scaling or z-score normalization.",
        "WHY":"Crucial for addressing performance issues in machine learning algorithms caused by numerically diverse attribute scales.",
        "EXAMPLE":"Reduce a numerical column with diverse range of values into a 0-1 scale for min-max or deviations above or below the mean for z score scaling"
        
    },

    "Missing Value Imputation":{
        "WHAT":"To fill or remove missing values in a specified column of the DataFrame.",
        "WHY":"Integrates missing value treatment efficiently into the data preprocessing pipeline, enhancing workflow efficiency and reducing errors.",
        "EXAMPLE":"A column with missing values will have those missing values updated with the options presented in the UI"
    },
 
    "Outlier Managament":{
        "WHAT":"To remove or modify outliers in all numeric columns of a DataFrame based on standard deviation",
        "WHY":"Essential for mitigating the impact of outliers on model performance, particularly in algorithms sensitive to data distribution like linear regression or clustering.",
        "EXAMPLE":"A column with outliers will habe those outliers removed based on the S.D. option presented in the UI"
    },

    "Numerical Column Binning":{
        "WHAT":"To categorize numeric data by binning it into specified ranges, transforming a numeric column into a categorical one.",
        "WHY":"Enables the identification of non-linear relationships in data, beneficial for models, especially linear ones, that assume linear feature-target relationships.",
        "EXAMPLE":"A numeric column can have its values put in specific sub ranges and categorized e.g. 'bins': [0,50,100], 'labels': [ 'Low','High']"
        },

    "Column Type Conversion":{
        "WHAT":"To change the data type of a specific column in a DataFrame to a new, specified type.",
        "WHY":"Allows change of datatype to enable type specific column cleaning opeations to be used",
        "EXAMPLE":"Change a column from numeric to text and unlock text cleaning features"
    },

    "Special Character Removal":{
        "WHAT":"To clean a text column in a DataFrame by removing any special characters, leaving only alphanumeric characters and spaces.",
        "WHY":"Improves dataset clarity by renaming verbose, typo-ridden, or inconsistent columns, enhancing readability for users.",
        "EXAMPLE":"A column with special characters like '@,.#!&' and more will have them removed"
    },

    "Trim Whitespace":{
        "WHAT":"To clean a text column in a DataFrame by trimming any leading and trailing whitespace.",
        "WHY":"Trimming whitespace reduces noise and potential errors in data processing and analysis, enhancing the overall data quality.",
        "EXAMPLE":"A text column with whitespace will have the whitespace removed"
        },

    "Replace Substrings":{
        "WHAT":"To replace occurrences of a specific substring with a new substring within a text column of a DataFrame.",
        "WHY":"Standardizes textual variations in datasets by replacing specific substrings, addressing inconsistencies in representations of words or phrases.",
        "EXAMPLE":"Replaces a string with another string e.g. 'old_substring': 'dog' , 'new_substring': 'cat' "
    }, 
    


        










        











}