{
    "NUMBEROFFIELDS":{
        "WHAT":"Displays the count of fields in the dataset.",
        "WHY":"In order to understand the Dataset field quantity and distribution"
        
        
    },
    "SPIDERCHART":{
        "WHAT":"A radial chart that shows data in terms of multiple variables. decribe what it does more.   ",
        "WHY":"Evaluate multiple metrics for a single record to determine data quality and consistency."
        
        
    },
    "NUMBEROFRECORDS":{
        "WHAT":"Displays the count of Records in the dataset.",
        "WHY":"In order to understand the Dataset size"
        
        
    },
    "bubble-chart":{
        "WHAT":"Visualises the categorical features within a column as bubbles.",
        "WHY":"Use to identify categorical distribution. Large bubbles may indicate asimetric data points needing normalisation."
        
        
    },
    "cardinality":{
        "WHAT":"Shows the uniqueness of data by representing the number of distinct values in a column.",
        "WHY":"Helpful for understanding when to collapse rare categories or when binning might be necessary for numeric to categorical conversions."
        
        
    },
    "correlation-scatter-plot":{
        "WHAT":"Illustrates the relationship between two variables and their correlation coefficient.",
        "WHY":"Use to determine if fields are redundant (high correlation) or if PCA might be useful for dimensionality reduction."
        
 
    },
    "data-quality-metric":{
        "WHAT":"Evaluates data quality across four dimensions: completeness, uniqueness, readability, and consistency, providing a comprehensive overview of data health.",
        "WHY":"Used as a Estimate to determine the readiness of the dataset before machine learning."
        
 
    },
    "data-types-chart":{
        "WHAT":"Categorizes data into different types (numeric, categorical, etc.).",
        "WHY":"Allows for a better fundemental understanding of data type distribution"
        
 
    },
    "duplicate-chart":{
        "WHAT":"Visualizes the frequency of duplicate records in a dataset.",
        "WHY":"shows duplicate records to be removed or merged."
        
 
    },
    "histogram":{
        "WHAT":"Represents the distribution of numerical data.",
        "WHY":"Analyze the distribution of values to inform normalization."
        
 
    },
    "missing-values-chart":{
        "WHAT":"Highlights the number of missing values within a column in a dataset.",
        "WHY":"Directs where to fill missing values or to decide if a column with too many missing values should be removed."
        
 
    },
    "outliers-scatter-plot":{
        "WHAT":"Identifies outlier data points in a dataset.",
        "WHY":"Pinpoints outliers for removal or further examination."
        
 
    },
    "":{
        "WHAT":"",
        "WHY":""
        
 
    },
    "":{
        "WHAT":"",
        "WHY":""
        
 
    },
    "":{
        "WHAT":"",
        "WHY":""
        
 
    }

}

   
  
  